# Generated by socfw

# Primary clocks
create_clock -name SYS_CLK -period 20.000 [get_ports {SYS_CLK}]

# Generated clocks
create_generated_clock -name clk_100mhz -multiply_by 2 -source [get_pins {clkpll|c0}] [get_pins {clkpll|c0}]

# Default IO delays
set_input_delay -clock sys_clk -max 3.000 [all_inputs]
set_output_delay -clock sys_clk -max 3.000 [all_outputs]

# False paths
set_false_path -from [get_ports {RESET_N}]
